/* Задайте массив из вещественных чисел с ненулевой дробной частью. 
Найдите разницу между максимальным и минимальным элементов массива. */

double[] array = {2.3, 4.3, 5.7, 7.1, 4.2};
double min = array[0];
double max = array[3];
double result = max - min;

 
 Console.Write(result);

 /* Не понял как решить через `for`, параллельно буду решать ее дальше */